---
kind: method
id: M:Autodesk.Revit.DB.PointCloudInstance.GetSelectionFilter
source: html/90e19864-52cf-2f0c-4792-698236b03c9b.htm
---
# Autodesk.Revit.DB.PointCloudInstance.GetSelectionFilter Method

Returns the currently active selection filter for this point cloud.

## Syntax (C#)
```csharp
public PointCloudFilter GetSelectionFilter()
```

## Returns
Currently active selection filter or Nothing nullptr a null reference ( Nothing in Visual Basic) if none is active.